export const wuxingToShishenList: string[][] = [
	['比劫', '财才', '食伤', '官杀', '印绶'],
	['官杀', '比劫', '印绶', '食伤', '财才'],
	['印绶', '食伤', '比劫', '财才', '官杀'],
	['财才', '印绶', '官杀', '比劫', '食伤'],
	['食伤', '官杀', '财才', '印绶', '比劫']
];

export const wangshuai = {
	寅卯: ['木旺', '火相', '水休', '金囚', '土死'],
	巳午: ['火旺', '土相', '木休', '水囚', '金死'],
	申酉: ['金旺', '水相', '土休', '火囚', '木死'],
	亥子: ['水旺', '木相', '金休', '土囚', '火死'],
	辰戌丑未: ['土旺', '金相', '火休', '木囚', '水死']
};

export const colorList: string[] = ['orange', 'green', 'blue', 'red', 'brown'];
export const wuxingLabelList: string[] = ['金', '木', '水', '火', '土'];
